// Вывести на экран слово “JAVA”, в строку, чтобы оно повторилось 10 раз, используя цикл while.
package day1;

public class Task1 {
    public static void main(String[] args) {
        int a = 0;
        while (a < 10) {
            System.out.print("JAVA ");
            a++;

        }
    }
}
